from data import writeDict,activities_question

activities = ["การแสดง","โชว์","พาเหรด"]

ans = "โชว์ช้างว่ายน้้ำ\nวันธรรมดา(จ.-ศ.) รอบแรก 11.00 รอบสอง 14.30\nวันหยุด(ส.-อา. และ วันหยุดนักขัตฤกษ์) รอบแรก 11.00 รอบสอง 12.30 รอบสาม 14.30\nพาเหรดนกกาบบัว\nวันธรรมดา(จ.-ศ.) รอบแรก 10.30 รอบสอง 14.30\nวันหยุด(ส.-อา. และ วันหยุดนักขัตฤกษ์) รอบแรก 10.30 รอบสอง 14.30\nพาเหรดเพนกวิน\nวันธรรมดา(จ.-ศ.) รอบแรก 10.00 รอบสอง 14.00\nวันหยุด(ส.-อา. และ วันหยุดนักขัตฤกษ์) รอบแรก 10.00 รอบสอง 14.00 รอบสาม 15.30"

activities_question("Activities",activities,ans)