import numpy as np
import pandas as pd
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.svm import SVC
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, classification_report
from pythainlp.tokenize import word_tokenize
from pythainlp.corpus.common import thai_stopwords
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.metrics import confusion_matrix
from sklearn.model_selection import train_test_split


class ChatBotZoo:
    def __init__(self):
        thai_stop = list(thai_stopwords())
        tokenized_stop_words = [word_tokenize(word) for word in thai_stop]
        flat_tokenized_stop_words = [item for sublist in tokenized_stop_words for item in sublist]
        unique_tokenized_stop_words = list(set(flat_tokenized_stop_words))
    
        self.vectorizer = TfidfVectorizer(tokenizer=self.tokenize, stop_words=unique_tokenized_stop_words)
        self.model = SVC(kernel='linear', probability=True, class_weight='balanced')
        self.classes = []
        self.answers_db = {}

    def tokenize(self, text):
        return word_tokenize(text, keep_whitespace=False)

    def train(self, texts, labels, answers):
        vectors = self.vectorizer.fit_transform(texts)
        self.model.fit(vectors, labels)
        self.classes = list(set(labels))
        self.answers_db = dict(zip(texts, answers))
        self.train_texts = texts

    def predict(self, text):
        vector = self.vectorizer.transform([text])
        predicted_class = self.model.predict(vector)[0]

        similarities = np.squeeze(np.asarray((vector * self.vectorizer.transform(self.train_texts).T).todense()))
        most_similar_idx = np.argmax(similarities)
        
        most_similar_question = self.train_texts[most_similar_idx]
        return self.answers_db[most_similar_question]
    

    def raw_predict(self, text):
        vector = self.vectorizer.transform([text])
        predicted_class = self.model.predict(vector)[0]
        return predicted_class

    def chat(self):
        print("ChatBotZoo Bot: สวัสดี! ฉันสามารถช่วยคุณได้อย่างไรวันนี้?")
        while True:
            user_input = input("คุณ: ")
            if user_input.lower() in ['ลาก่อน', 'ออก', 'หยุด','ควย']:
                print("ChatBotZoo Bot: ลาก่อน!")
                break
            response = self.predict(user_input)
            print(f"ChatBotZoo Bot: {response}")


classes = ["Mammal"]*69
classes += ["Poultry"]*99
classes += ["Reptile"]*45
classes += ["Price"]*43
classes += ["Schedule"]*34
classes += ["Promotion"]*12
classes += ["Activities"]*8
classes += ["Contact"]*17


questions = ['ฮิปโปโปเตมัสอยู่ไหน','ฮิปโปโปเตมัสมีไหม','ฮิปโปโปเตมัสหาได้ที่ไหน','เนื้อทรายอยู่ไหน','เนื้อทรายมีไหม','เนื้อทรายหาได้ที่ไหน','ชะนีมงกุฎอยู่ไหน','ชะนีมงกุฎมีไหม','ชะนีมงกุฎหาได้ที่ไหน','ไนอาลาอยู่ไหน','ไนอาลามีไหม','ไนอาลาหาได้ที่ไหน','ช้างเอเชียอยู่ไหน','ช้างเอเชียมีไหม','ช้างเอเชียหาได้ที่ไหน','นากเล็กเล็บสั้นอยู่ไหน','นากเล็กเล็บสั้นมีไหม','นากเล็กเล็บสั้นหาได้ที่ไหน','ชะนีแก้มขาวเหนืออยู่ไหน','ชะนีแก้มขาวเหนือมีไหม','ชะนีแก้มขาวเหนือหาได้ที่ไหน','ค่างแว่นถิ่นใต้อยู่ไหน','ค่างแว่นถิ่นใต้มีไหม','ค่างแว่นถิ่นใต้หาได้ที่ไหน','ยีราฟอยู่ไหน','ยีราฟมีไหม','ยีราฟหาได้ที่ไหน','กระจงหนูอยู่ไหน','กระจงหนูมีไหม','กระจงหนูหาได้ที่ไหน','กระทิงอยู่ไหน','กระทิงมีไหม','กระทิงหาได้ที่ไหน','กวางดาวอยู่ไหน','กวางดาวมีไหม','กวางดาวหาได้ที่ไหน','กวางป่าอยู่ไหน','กวางป่ามีไหม','กวางป่าหาได้ที่ไหน','ค่างห้าสีอยู่ไหน','ค่างห้าสีมีไหม','ค่างห้าสีหาได้ที่ไหน','จิงโจ้แดงอยู่ไหน','จิงโจ้แดงมีไหม','จิงโจ้แดงหาได้ที่ไหน','ตัวกินมดยักษ์อยู่ไหน','ตัวกินมดยักษ์มีไหม','ตัวกินมดยักษ์หาได้ที่ไหน','ม้าลายเบอร์เชลอยู่ไหน','ม้าลายเบอร์เชลมีไหม','ม้าลายเบอร์เชลหาได้ที่ไหน','ละมั่งพันธุ์พม่าอยู่ไหน','ละมั่งพันธุ์พม่ามีไหม','ละมั่งพันธุ์พม่าหาได้ที่ไหน','ลิงชิมแพนซีอยู่ไหน','ลิงชิมแพนซีมีไหม','ลิงชิมแพนซีหาได้ที่ไหน','สมเสร็จอยู่ไหน','สมเสร็จมีไหม','สมเสร็จหาได้ที่ไหน','สิงโตอยู่ไหน','สิงโตมีไหม','สิงโตหาได้ที่ไหน','สล็อตสองนิ้วอยู่ไหน','สล็อตสองนิ้วมีไหม','สล็อตสองนิ้วหาได้ที่ไหน','หมีหมาอยู่ไหน','หมีหมามีไหม','หมีหมาหาได้ที่ไหน']
questions += ['นกกระตั้วดำอยู่ไหน','นกกระตั้วดำมีไหม','นกกระตั้วดำหาได้ที่ไหน','นกกระแตแต้แว๊ดอยู่ไหน','นกกระแตแต้แว๊ดมีไหม','นกกระแตแต้แว๊ดหาได้ที่ไหน','นกกุลาอยู่ไหน','นกกุลามีไหม','นกกุลาหาได้ที่ไหน','นกขมิ้นท้ายทอยดำอยู่ไหน','นกขมิ้นท้ายทอยดำมีไหม','นกขมิ้นท้ายทอยดำหาได้ที่ไหน','นกค๊อกคาเทลอยู่ไหน','นกค๊อกคาเทลมีไหม','นกค๊อกคาเทลหาได้ที่ไหน','นกตะกรามอยู่ไหน','นกตะกรามมีไหม','นกตะกรามหาได้ที่ไหน','นกตีทองอยู่ไหน','นกตีทองมีไหม','นกตีทองหาได้ที่ไหน','นกปรอดสวนอยู่ไหน','นกปรอดสวนมีไหม','นกปรอดสวนหาได้ที่ไหน','นกปรอดหัวสีเขม่าอยู่ไหน','นกปรอดหัวสีเขม่ามีไหม','นกปรอดหัวสีเขม่าหาได้ที่ไหน','นกปรอดหัวโขนอยู่ไหน','นกปรอดหัวโขนมีไหม','นกปรอดหัวโขนหาได้ที่ไหน','นกปรอดเหลืองหัวจุกอยู่ไหน','นกปรอดเหลืองหัวจุกมีไหม','นกปรอดเหลืองหัวจุกหาได้ที่ไหน','นกปรอดแม่ทะอยู่ไหน','นกปรอดแม่ทะมีไหม','นกปรอดแม่ทะหาได้ที่ไหน','นกพิราบหงอนวิคตอเรียอยู่ไหน','นกพิราบหงอนวิคตอเรียมีไหม','นกพิราบหงอนวิคตอเรียหาได้ที่ไหน','นกลุมพูเขียวอยู่ไหน','นกลุมพูเขียวมีไหม','นกลุมพูเขียวหาได้ที่ไหน','นกหกเล็กปากดำอยู่ไหน','นกหกเล็กปากดำมีไหม','นกหกเล็กปากดำหาได้ที่ไหน','นกเขาเขียวอยู่ไหน','นกเขาเขียวมีไหม','นกเขาเขียวหาได้ที่ไหน','นกเขาเปล้าธรรมดาอยู่ไหน','นกเขาเปล้าธรรมดามีไหม','นกเขาเปล้าธรรมดาหาได้ที่ไหน','นกเขาใหญ่อยู่ไหน','นกเขาใหญ่มีไหม','นกเขาใหญ่หาได้ที่ไหน','นกเขียวก้านตองปีกสีฟ้าอยู่ไหน','นกเขียวก้านตองปีกสีฟ้ามีไหม','นกเขียวก้านตองปีกสีฟ้าหาได้ที่ไหน','นกเขียวก้านตองใหญ่อยู่ไหน','นกเขียวก้านตองใหญ่มีไหม','นกเขียวก้านตองใหญ่หาได้ที่ไหน','นกเขียวครามอยู่ไหน','นกเขียวครามมีไหม','นกเขียวครามหาได้ที่ไหน','นกเงือกกรามช้างอยู่ไหน','นกเงือกกรามช้างมีไหม','นกเงือกกรามช้างหาได้ที่ไหน','นกเงือกหัวแรดอยู่ไหน','นกเงือกหัวแรดมีไหม','นกเงือกหัวแรดหาได้ที่ไหน','นกเงือกหัวหงอกอยู่ไหน','นกเงือกหัวหงอกมีไหม','นกเงือกหัวหงอกหาได้ที่ไหน','นกเพนกวินฮัมโบลด์อยู่ไหน','นกเพนกวินฮัมโบลด์มีไหม','นกเพนกวินฮัมโบลด์หาได้ที่ไหน','นกเอี้ยงหงอนอยู่ไหน','นกเอี้ยงหงอนมีไหม','นกเอี้ยงหงอนหาได้ที่ไหน','นกแก้วเอคเลคตัสอยู่ไหน','นกแก้วเอคเลคตัสมีไหม','นกแก้วเอคเลคตัสหาได้ที่ไหน','นกแต้วแล้วธรรมดาอยู่ไหน','นกแต้วแล้วธรรมดามีไหม','นกแต้วแล้วธรรมดาหาได้ที่ไหน','หงส์ดำอยู่ไหน','หงส์ดำมีไหม','หงส์ดำหาได้ที่ไหน','เป็ดวู๊ดอยู่ไหน','เป็ดวู๊ดมีไหม','เป็ดวู๊ดหาได้ที่ไหน','เป็ดหงส์อยู่ไหน','เป็ดหงส์มีไหม','เป็ดหงส์หาได้ที่ไหน','เหยี่ยวแดงอยู่ไหน','เหยี่ยวแดงมีไหม','เหยี่ยวแดงหาได้ที่ไหน','นกกระจอกเทศอยู่ไหน','นกกระจอกเทศมีไหม','นกกระจอกเทศหาได้ที่ไหน']
questions += ['เต่าบึงหัวเหลืองอยู่ไหน','เต่าบึงหัวเหลืองมีไหม','เต่าบึงหัวเหลืองหาได้ที่ไหน','งูหลามอยู่ไหน','งูหลามมีไหม','งูหลามหาได้ที่ไหน','งูหลามทองอยู่ไหน','งูหลามทองมีไหม','งูหลามทองหาได้ที่ไหน','งูหลามบอลอยู่ไหน','งูหลามบอลมีไหม','งูหลามบอลหาได้ที่ไหน','งูเขียวหางไหม้ท้องเขียวอยู่ไหน','งูเขียวหางไหม้ท้องเขียวมีไหม','งูเขียวหางไหม้ท้องเขียวหาได้ที่ไหน','เคย์แมนอยู่ไหน','เคย์แมนมีไหม','เคย์แมนหาได้ที่ไหน','ตะโขงอยู่ไหน','ตะโขงมีไหม','ตะโขงหาได้ที่ไหน','งูเขียวหางไหม้ตาโตอยู่ไหน','งูเขียวหางไหม้ตาโตมีไหม','งูเขียวหางไหม้ตาโตหาได้ที่ไหน','งูเขียวหางไหม้ท้องเหลืองอยู่ไหน','งูเขียวหางไหม้ท้องเหลืองมีไหม','งูเขียวหางไหม้ท้องเหลืองหาได้ที่ไหน','ตะพาบม่านลายอยู่ไหน','ตะพาบม่านลายมีไหม','ตะพาบม่านลายหาได้ที่ไหน','งูเห่าไทยอยู่ไหน','งูเห่าไทยมีไหม','งูเห่าไทยหาได้ที่ไหน','งูแสงอาทิตย์อยู่ไหน','งูแสงอาทิตย์มีไหม','งูแสงอาทิตย์หาได้ที่ไหน','เต่าจมูกหมูอยู่ไหน','เต่าจมูกหมูมีไหม','เต่าจมูกหมูหาได้ที่ไหน','เต่ากระอานอยู่ไหน','เต่ากระอานมีไหม','เต่ากระอานหาได้ที่ไหน','เต่าแก้มแดงอยู่ไหน','เต่าแก้มแดงมีไหม','เต่าแก้มแดงหาได้ที่ไหน']
questions += ['บัตรคนแก่','คนแก่กี่บาท','ราคาเข้าคนแก่','บัตรคนแก่เท่าไร','ค่าเข้าคนแก่เท่าไร','บัตรเด็ก','เด็กกี่บาท','ราคาเข้าเด็ก','บัตรเด็กเท่าไร','ค่าเข้าเด็กเท่าไร','บัตรผู้ใหญ่','ผู้ใหญ่กี่บาท','ราคาเข้าผู้ใหญ่','บัตรผู้ใหญ่เท่าไร','ค่าเข้าผู้ใหญ่เท่าไร','บัตรคนพิการ','คนพิการกี่บาท','ราคาเข้าคนพิการ','บัตรคนพิการเท่าไร','ค่าเข้าคนพิการเท่าไร','บัตรข้าราชการ','ข้าราชการกี่บาท','ราคาเข้าข้าราชการ','บัตรข้าราชการเท่าไร','ค่าเข้าข้าราชการเท่าไร','บัตรนักเรียน','นักเรียนกี่บาท','ราคาเข้านักเรียน','บัตรนักเรียนเท่าไร','ค่าเข้านักเรียนเท่าไร','บัตรนักศึกษา','นักศึกษากี่บาท','ราคาเข้านักศึกษา','บัตรนักศึกษาเท่าไร','ค่าเข้านักศึกษาเท่าไร','ค่าเข้า','ค่าเข้ากี่บาท','ราคาบัตร','บัตรเข้ากี่บาท','บัตรเข้าสวนสัตว์กี่บาท','ราคาเข้า','บัตรเข้าราคา','เท่าไร']
questions += ['วันจันทร์เปิดกี่โมง','วันจันทร์ปิดกี่โมง','จันทร์เปิดกี่โมง','จันทร์ปิดกี่โมง','จันเปิดกี่โมง','จันปิดกี่โมง','วันอังคารเปิดกี่โมง','วันอังคารปิดกี่โมง','อังคารเปิดกี่โมง','อังคารปิดกี่โมง','วันพุธเปิดกี่โมง','วันพุธปิดกี่โมง','พุธเปิดกี่โมง','พุธปิดกี่โมง','วันพฤหัสบดีเปิดกี่โมง','วันพฤหัสบดีปิดกี่โมง','พฤหัสบดีเปิดกี่โมง','พฤหัสบดีปิดกี่โมง','วันศุกร์เปิดกี่โมง','วันศุกร์ปิดกี่โมง','ศุกร์เปิดกี่โมง','ศุกร์ปิดกี่โมง','วันเสาร์เปิดกี่โมง','วันเสาร์ปิดกี่โมง','เสาร์เปิดกี่โมง','เสาร์ปิดกี่โมง','วันอาทิตย์เปิดกี่โมง','วันอาทิตย์ปิดกี่โมง','อาทิตย์เปิดกี่โมง','อาทิตย์ปิดกี่โมง','เปิดกี่โมง','ปิดกี่โมง','เปิดปิดกี่โมง','เปิด-ปิดกี่โมง']
questions += ['promotion','โปรมีชัน','โปร','มีโปรไหม','มีโปรโมชันไหม','มี promotion ไหม','มี pro ไหม','ส่วนลด','มีส่วนลดไหม','ลดได้ไหม','ฟรีตอนไหนบ้าง','ฟรี']
questions += ['การแสดง','มีการแสดงอะไรบ้าง','โชว์','มีโชว์อะไรบ้าง','พาเหรด','มีพาเหรดอะไรบ้าง','รอบการแสดง','ขอดูรอบการแสดงหน่อย']
questions += ['ติดต่อทางไหนได้บ้าง','มีเฟสบุ้กไหม','ขอเฟสหน่อย','มี Line ไหม','ขอไลน์หน่อย','มี fb ไหม','ขอ ig หน่อย','มี ig ไหม','เบอร์','ขอเบอร์','เบอร์อะไร','ig','fb','line','facebook','instagram','line']

answers = ["อยู่ในโซนสัตว์สัตว์เลี้ยงลูกด้วยนมของสวนสัตว์"]*69
answers += ["อยู่ในโซนสัตว์สัตว์ปึกของสวนสัตว์"]*99
answers += ["อยู่ในโซนสัตว์เลื้อยคลานของสวนสัตว์"]*45
answers += ["ผู้ใหญ่ 150 บาท\nเด็ก(สูงไม่เกิน 135 เซนติเมตร) 30 บาท\nผู้สูงอายุ 60 ปีขึ้นไป คนพิการ ผู้มีบัตรอนุญาตพิเศษ ฟรี\nเด็ก ชาวต่างชาติ 100 บาท\nผู้ใหญ่ ชาวต่างชาติ 250 บาท\nข้าราชการ, นักเรียน,นักศึกษา(แสดงบัตร) 70 บาท"]*43
answers += ["ที่นี่เปิดทุกวัน จันทร์-อาทิตย์ เวลา 08:00-17:00 ค่ะ"]*34
answers += ["มีโปรโมชันทุกวันแม่คุณแม่เข้าฟรี และทุกวันเด็ก เด็กอายุไม่เกิน 15 ปี(สูงไม่เกิน 135 เซนติเมตร) เข้าฟรีค่ะ"]*12
answers += ["โชว์ช้างว่ายน้้ำ\nวันธรรมดา(จ.-ศ.) รอบแรก 11.00 รอบสอง 14.30\nวันหยุด(ส.-อา. และ วันหยุดนักขัตฤกษ์) รอบแรก 11.00 รอบสอง 12.30 รอบสาม 14.30\nพาเหรดนกกาบบัว\nวันธรรมดา(จ.-ศ.) รอบแรก 10.30 รอบสอง 14.30\nวันหยุด(ส.-อา. และ วันหยุดนักขัตฤกษ์) รอบแรก 10.30 รอบสอง 14.30\nพาเหรดเพนกวิน\nวันธรรมดา(จ.-ศ.) รอบแรก 10.00 รอบสอง 14.00\nวันหยุด(ส.-อา. และ วันหยุดนักขัตฤกษ์) รอบแรก 10.00 รอบสอง 14.00 รอบสาม 15.30"]*8
answers += ["ติดต่อได้ตามช่องทางต่อไปนี้ค่ะ\nFacebook : สวนสัตว์เปิดเขาเขียว Khao Kheow Open Zoo\nLine : kkopenzoo\nInstagram : khaokheow.zoo\nเบอร์โทรศัพท์ : 038 318 444"]*17

bot = ChatBotZoo()
bot.train(questions, classes, answers)

# Begin interaction
bot.chat()

# questions_train, questions_test, classes_train, classes_test, answers_train, answers_test = train_test_split(questions, classes, answers, test_size=0.3, random_state=42)

# bot.train(questions_train, classes_train, answers_train)

# predicted_classes = [bot.predict(question) for question in questions_test]

# accuracy = accuracy_score(classes_test, predicted_classes)
# print(f"Accuracy: {accuracy * 100:.2f}%")

# print(classification_report(classes_test, predicted_classes))

# X_train, X_test, y_train, y_test = train_test_split(questions, classes, test_size=0.2, random_state=42)

# bot = ChatBotZoo()
# bot.train(X_train, y_train, answers)

# y_pred = [bot.raw_predict(text) for text in X_test]

# conf_mat = confusion_matrix(y_test, y_pred, labels=bot.classes)
# conf_mat_normalized = conf_mat.astype('float') / conf_mat.sum(axis=1)[:, np.newaxis] * 100  # Multiply by 100 to convert to percentage

# plt.figure(figsize=(10,8))
# sns.heatmap(conf_mat_normalized, annot=True, fmt=".2f", cmap="Blues", xticklabels=bot.classes, yticklabels=bot.classes)
# plt.xlabel('Predicted')
# plt.ylabel('True')
# plt.title('Confusion Matrix (Percentage)')
# plt.show()