reptile = ["เต่าบึงหัวเหลือง", "งูหลาม", "งูหลามทอง", "งูหลามบอล", "งูเขียวหางไหม้ท้องเขียว", "เคย์แมน", "ตะโขง", "งูเขียวหางไหม้ตาโต",
           "งูเขียวหางไหม้ท้องเหลือง", "ตะพาบม่านลาย","งูเห่าไทย", "งูแสงอาทิตย์", "เต่าจมูกหมู", "เต่ากระอาน", "เต่าแก้มแดง"]

reptile_food = {'เต่าบึงหัวเหลือง':'กินพืช ผัก ผลไม้ และกินหนอน แมลง',
                'งูหลาม':'กินนกและสัตว์เลี้ยงลูกด้วยน้ำนม รวมทั้งกลุ่มกบและสัตว์เลื้อยคลาน',
                'งูหลามทอง':'กินเป็ด ไก่ นก หนู กระต่าย สุนัข เก้ง',
                'งูหลามบอล':'กินสัตว์เลี้ยงลูกด้วยนมขนาดเล็ก เช่น หนู',
                'งูเขียวหางไหม้ท้องเขียว':'กินสัตว์เลี้ยงลูกด้วยนมขนาดเล็ก และนก',
                'เคย์แมน':'กินสัตว์น้ำ เช่นปลา แมลง หอยทาก',
                'ตะโขง':'กินปลาและสัตว์น้ำขนาดเล็ก',
                'งูเขียวหางไหม้ตาโต':'กินสัตว์เลี้ยงลูกด้วยนมขนาดเล็ก และนก',
                'งูเขียวหางไหม้ท้องเหลือง':'กินสัตว์เลี้ยงลูกด้วยนมขนาดเล็ก และนก',
                'ตะพาบม่านลาย':'ชอบกินกบ เขียด ปู กุ้ง ปลา',
                'งูเห่าไทย':'กินนก หนู กบ เขียด ลูกไก่ แม้กระทั่งงู แบะชอบกินคางคกเป็นพิเศษ',
                'งูแสงอาทิตย์':'กินนก หนู กบ เขียด ลูกไก่ หรือแม้กระทั่งงูเห่าที่มีขนาดเล็กกว่า',
                'เต่าจมูกหมู':'กินทั้งพืชและสัตว์ แต่ชอบกินพืชมากกว่าสัตว์ มักจะกินผลไม้และใบไม้จากมะเดื่อป่าและพืชอื่น ๆ ที่เติบโตตามแนวฝั่งแม่น้ำ',
                'เต่ากระอาน':'กินทั้งพืชและสัตว์ แต่ส่วนใหญ่อาหารจะประกอบด้วยผักและผลไม้',
                'เต่าแก้มแดง':'กินทั้งพืชและสัตว์ พืช ผัก ผลไม้ สัตว์ขนาดเล็ก และซากสัตว์'
                }