import csv

def ReptileClass(animalType,animal,questions,answers) :
    with open(animalType+'.csv', 'w', newline='',encoding="UTF-8") as file:
        writer = csv.writer(file)
        writer.writerow(["Reptile", "Question", "Answer"])
        for name in animal :
            for question in questions :
                for answer in answers :
                    writer.writerow([animalType, f"{name}{question}", f"{answer}"])

reptile = ["เต่าบึงหัวเหลือง", "งูหลาม", "งูหลามทอง", "งูหลามบอล", "งูเขียวหางไหม้ท้องเขียว", "เคย์แมน", "ตะโขง", "งูเขียวหางไหม้ตาโต",
           "งูเขียวหางไหม้ท้องเหลือง", "ตะพาบม่านลาย","งูเห่าไทย", "งูแสงอาทิตย์", "เต่าจมูกหมู", "เต่ากระอาน", "เต่าแก้มแดง"]

reptile_question = ["อยู่ไหน","มีไหม","หาได้ที่ไหน"]
reptile_ans = ["อยู่ในโซนสัตว์เลื้อยคลานของสวนสัตว์"]


ReptileClass("Reptile",reptile,reptile_question,reptile_ans)

answer = ["Reptile"]*45
question = ['เต่าบึงหัวเหลืองอยู่ไหน','เต่าบึงหัวเหลืองมีไหม','เต่าบึงหัวเหลืองหาได้ที่ไหน','งูหลามอยู่ไหน','งูหลามมีไหม','งูหลามหาได้ที่ไหน','งูหลามทองอยู่ไหน','งูหลามทองมีไหม','งูหลามทองหาได้ที่ไหน','งูหลามบอลอยู่ไหน','งูหลามบอลมีไหม','งูหลามบอลหาได้ที่ไหน','งูเขียวหางไหม้ท้องเขียวอยู่ไหน','งูเขียวหางไหม้ท้องเขียวมีไหม','งูเขียวหางไหม้ท้องเขียวหาได้ที่ไหน','เคย์แมนอยู่ไหน','เคย์แมนมีไหม','เคย์แมนหาได้ที่ไหน','ตะโขงอยู่ไหน','ตะโขงมีไหม','ตะโขงหาได้ที่ไหน','งูเขียวหางไหม้ตาโตอยู่ไหน','งูเขียวหางไหม้ตาโตมีไหม','งูเขียวหางไหม้ตาโตหาได้ที่ไหน','งูเขียวหางไหม้ท้องเหลืองอยู่ไหน','งูเขียวหางไหม้ท้องเหลืองมีไหม','งูเขียวหางไหม้ท้องเหลืองหาได้ที่ไหน','ตะพาบม่านลายอยู่ไหน','ตะพาบม่านลายมีไหม','ตะพาบม่านลายหาได้ที่ไหน','งูเห่าไทยอยู่ไหน','งูเห่าไทยมีไหม','งูเห่าไทยหาได้ที่ไหน','งูแสงอาทิตย์อยู่ไหน','งูแสงอาทิตย์มีไหม','งูแสงอาทิตย์หาได้ที่ไหน','เต่าจมูกหมูอยู่ไหน','เต่าจมูกหมูมีไหม','เต่าจมูกหมูหาได้ที่ไหน','เต่ากระอานอยู่ไหน','เต่ากระอานมีไหม','เต่ากระอานหาได้ที่ไหน','เต่าแก้มแดงอยู่ไหน','เต่าแก้มแดงมีไหม','เต่าแก้มแดงหาได้ที่ไหน']
answer = ["อยู่ในโซนสัตว์เลื้อยคลานของสวนสัตว์"]*45