from data import writeDict, schedule_question

# time = ["เปิดกี่โมง","ปิดกี่โมง","เปิดปิดกี่โมง","เปิด-ปิดกี่โมง",
#         "วันจันทร์เปิดกี่โมง","วันจันทร์ปิดกี่โมง",
#         "วันอังคารเปิดกี่โมง","วันอังคารปิดกี่โมง",
#         "วันพุธเปิดกี่โมง","วันพุธปิดกี่โมง",
#         "วันพฤหัสเปิดกี่โมง","วันพฤหัสปิดกี่โมง",
#         "วันศุกร์เปิดกี่โมง","วันศุกร์เปิดกี่โมง",
#         "วันเสาร์เปิดกี่โมง","วันเสาร์ปิดกี่โมง",
#         "วันอาทิตย์เปิดกี่โมง","วันอาทิตย์ปิดกี่โมง",]

day = ["วันจันทร์","จันทร์","จัน",
       "วันอังคาร","อังคาร",
       "วันพุธ","พุธ",
       "วันพฤหัสบดี","พฤหัสบดี",
       "วันศุกร์","ศุกร์",
       "วันเสาร์","เสาร์",
       "วันอาทิตย์","อาทิตย์"
       ]

ans = ["ที่นี่เปิดทุกวัน จันทร์-อาทิตย์ เวลา 08:00-17:00 ค่ะ"]

schedule_question("day",day,ans)

#writeDict(day,"Schedule")
